app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "title"], ["text", "text"], ["created_at", "2016-02-14 13:57:16.485149"], ["updated_at", "2016-02-14 13:57:16.485149"]]
---
  def create
  	# render plain: params[:article].inspect
  	@article = Article.new(article_params)

  	if @article.save